scripts/load-test/signup-burst.artillery.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    # Targets ~40k arrivals to complement the parallel k6 'huge' profile
    # (~60k flows) for a combined 100k-candidate burst.
    - name: warmup
      duration: 30
      arrivalRate: 10
    - name: ramp
      duration: 60
      arrivalRate: 10
      rampTo: 60
    - name: sustain
      duration: 600
      arrivalRate: 60
    - name: cooldown
      duration: 60
      arrivalRate: 10
  http:
    timeout: 30
    pool: 200
  processor: "./signup-burst.artillery.helpers.cjs"
  ensure:
    thresholds:
      - http.response_time.p95: 5000
      - http.response_time.p99: 10000
      - http.codes.500: 0
scenarios:
  - name: individual-signup-end-to-end
    weight: 1
    flow:
      - function: "genIdentity"
      - post:
          url: "/api/auth/otp/request"
          json:
            phone: "{{ phone }}"
            purpose: "register"
          capture:
            - json: "$.success"
              as: "otpRequested"
          expect:
            - statusCode: [200, 201]
      - get:
          url: "/api/_dev/last-otp/{{ phone }}"
          capture:
            - json: "$.code"
              as: "otp"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/otp/verify"
          json:
            phone: "{{ phone }}"
            code: "{{ otp }}"
            purpose: "register"
          capture:
            - json: "$.otpId"
              as: "otpId"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/register"
          json:
            fullName: "Burst Tester {{ phone }}"
            phone: "{{ phone }}"
            nationalId: "{{ nid }}"
            password: "LoadTest@2026!"
            otpId: "{{ otpId }}"
          expect:
            - statusCode: [200, 201]